jtn0123/ESP32-S3-display-dashboard/sdkconfig.defaults
# ESP32-S3 specific
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# Flash size
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# Enable both CPUs
CONFIG_FREERTOS_UNICORE=n

# Partition Table - Use ESP-IDF default
# CONFIG_PARTITION_TABLE_CUSTOM=y
# CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partition_table/partitions.csv"

# Increase main task stack size
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Enable panic handler
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y

# Optimize for size
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# HTTP Server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024

# WiFi
CONFIG_ESP32_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP32_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP32_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP32_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP32_WIFI_TX_BA_WIN=6
CONFIG_ESP32_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP32_WIFI_RX_BA_WIN=6

# Power Management
CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=y

# FreeRTOS tick rate (1000 Hz for smoother animations)
CONFIG_FREERTOS_HZ=1000

# Enable console output
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# NVS for configuration storage
CONFIG_NVS_ENCRYPTION=n

# Reduce bootloader log verbosity
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Enable core dump to flash
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y

# Disable unused features to save space
CONFIG_ESP32S3_SPIRAM_SUPPORT=n
CONFIG_ESP32S3_TRAX=n
CONFIG_ESP32S3_TRACEMEM_RESERVE_DRAM=0